{
  "architectures": [
    "VITAUTUV1ForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "audio_projection_norm_type": "rms_norm",
  "auto_map": {
    "AutoConfig": "configuration_utu_v1.UTUV1Config",
    "AutoModelForCausalLM": "modeling_utu_v1.VITAUTUV1ForCausalLM"
  },
  "bos_token_id": 128000,
  "codebook_size": 1032,
  "embedding_initializer_range": 0.025,
  "eos_token_id": 128001,
  "ep_size": 1,
  "first_k_dense_replace": 40,
  "head_dim": 64,
  "hidden_act": "silu",
  "hidden_size": 2560,
  "initializer_range": 0.0125,
  "intermediate_size": 9728,
  "kv_lora_rank": 512,
  "max_position_embeddings": 131072,
  "mlp_bias": false,
  "model_type": "vita_utu_v1",
  "moe_intermediate_size": null,
  "moe_layer_freq": 0,
  "mtp_loss_weight": 0.3,
  "n_group": null,
  "n_routed_experts": null,
  "n_shared_experts": null,
  "norm_topk_prob": false,
  "num_attention_heads": 32,
  "num_codebook": 8,
  "num_experts_per_tok": null,
  "num_hidden_layers": 40,
  "num_key_value_heads": 8,
  "num_nextn_predict_layers": 0,
  "pretraining_tp": 1,
  "q_lora_rank": 1536,
  "qk_head_dim": 192,
  "qk_nope_head_dim": 128,
  "qk_rope_head_dim": 64,
  "rms_norm_eps": 1e-06,
  "rope_interleave": true,
  "rope_scaling": null,
  "rope_theta": 500000,
  "routed_scaling_factor": null,
  "speaker_embedding_size": 192,
  "tie_word_embeddings": true,
  "topk_group": null,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.51.3",
  "use_audio_heads": false,
  "use_cache": false,
  "use_speaker_embedding": true,
  "v_head_dim": 128,
  "vocab_size": 136544
}
