{
  "architectures": [
    "Qwen3MTPSenseVoiceForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "audio_projection_norm_type": "layer_norm",
  "auto_map": {
    "AutoConfig": "configuration_qwen3.Qwen3MTPSenseVoiceConfig",
    "AutoModelForCausalLM": "modeling_qwen3.Qwen3MTPSenseVoiceForCausalLM"
  },
  "bos_token_id": 151643,
  "codebook_size": 1032,
  "eos_token_id": 151645,
  "head_dim": 128,
  "hidden_act": "silu",
  "hidden_size": 4096,
  "initializer_range": 0.02,
  "intermediate_size": 12288,
  "max_position_embeddings": 40960,
  "max_window_layers": 36,
  "model_type": "qwen3_sensevoice_xy",
  "mtp_loss_weight": 1.0,
  "num_attention_heads": 32,
  "num_codebook": 8,
  "num_hidden_layers": 36,
  "num_key_value_heads": 8,
  "num_nextn_predict_layers": 0,
  "rms_norm_eps": 1e-06,
  "rope_scaling": null,
  "rope_theta": 1000000,
  "sliding_window": null,
  "speaker_embedding_size": 192,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.51.3",
  "use_audio_heads": false,
  "use_cache": false,
  "use_sliding_window": false,
  "use_speaker_embedding": true,
  "vocab_size": 159960
}
